module.exports = {
  ALLDATA: ALLDATA,
  DXH_L: DXH_L,
  DXH_M: DXH_M,
  WLXB_L: WLXB_L,
  WLXB_M: WLXB_M,
  GXB_L: GXB_L,
  GXB_M: GXB_M,
  SCHOOLS: SCHOOLS,
  SCHOOLS_GATE: SCHOOLS_GATE,
  JIUYE:JIUYE,
  BAOGAOTING: BAOGAOTING,
  TIYUGUAN:TIYUGUAN,
  DITIE:DITIE,
}

var WLXB = [
  [30.53669967, 114.360643, "0"],
  [30.53668581, 114.3605894, "0"],
  [30.53658879, 114.3604982, "0"],
  [30.53653796, 114.3604982, "0"],
  [30.53648714, 114.3605143, "0"],
  [30.53638087, 114.3604285, "教五楼"],
  [30.53637625, 114.3604338, "0"],
  [30.53621915, 114.3603319, "0"],
  [30.53598351, 114.3602085, "0"],
  [30.53540596, 114.3599939, "0"],
  [30.53515183, 114.3599188, "0"],
  [30.53486998, 114.3598223, "0"],
  [30.53482378, 114.3598115, "0"],
  [30.53468054, 114.3597418, "0"],
  [30.53444952, 114.3595648, "0"],
  [30.53420925, 114.3593073, "0"],
  [30.53408912, 114.3591249, "0"],
  [30.53400595, 114.3590176, "校大门"],
  [30.53388119, 114.3589211, "0"],
  [30.53392278, 114.3590659, "校大门"],
  [30.53406139, 114.3592697, "0"],
  [30.53415842, 114.3594092, "0"],
  [30.53430166, 114.3595541, "0"],
  [30.53445414, 114.3596935, "0"],
  [30.53462048, 114.3598115, "0"],
  [30.53474523, 114.3598706, "0"],
  [30.53494391, 114.3599564, "0"],
  [30.53510563, 114.3600154, "0"],
  [30.53535975, 114.3601066, "0"],
  [30.53559077, 114.3601763, "0"],
  [30.53581256, 114.3602514, "0"],
  [30.53607592, 114.3603587, "0"],
  [30.53613599, 114.3603909, "0"],
  [30.5363208, 114.3605036, "教五楼"],
  [30.53642245, 114.3605733, "0"],
  [30.53640859, 114.3606323, "0"],
  [30.53644093, 114.3607181, "0"],
  [30.53648714, 114.3607664, "0"],
  [30.53660727, 114.3607718, "0"],
  [30.53668119, 114.3607181, "0"],
  [30.53669967, 114.360643, "0"],
  [30.5367967, 114.3606967, "0"],
  [30.53691221, 114.3607718, "0"],
  [30.53698614, 114.3608844, "0"],
  [30.53712475, 114.3611795, "0"],
  [30.53730032, 114.3617964, "0"],
  [30.53738349, 114.3619627, "0"],
  [30.53755444, 114.3622255, "0"],
  [30.53762375, 114.3623972, "0"],
  [30.53743894, 114.3627298, "0"],
  [30.53723102, 114.3630999, "鉴湖"],
  [30.53713399, 114.3632823, "0"],
  [30.53708779, 114.3634218, "0"],
  [30.53707393, 114.3636417, "0"],
  [30.53707393, 114.3638992, "0"],
  [30.53706931, 114.3641943, "0"],
  [30.53707855, 114.364323, "0"],
  [30.53712013, 114.3645108, "0"],
  [30.53717557, 114.3646556, "0"],
  [30.53725874, 114.3648058, "0"],
  [30.53735115, 114.3649238, "0"],
  [30.53742045, 114.3650311, "0"],
  [30.53754058, 114.3651974, "0"],
  [30.53760527, 114.365353, "0"],
  [30.53766071, 114.3655086, "0"],
  [30.53770692, 114.3657446, "0"],
  [30.53773926, 114.3659377, "0"],
  [30.5377716, 114.3663615, "0"],
  [30.5377947, 114.3667424, "0"],
  [30.5378178, 114.3669516, "行政楼"],
  [30.53784091, 114.3671393, "0"],
  [30.53790097, 114.3671715, "0"],
  [30.53797027, 114.367252, "0"],
  [30.53809964, 114.3673164, "0"],
  [30.53863098, 114.3672734, "0"],
  [30.53869566, 114.3672574, "0"],
  [30.53985997, 114.3671179, "0"],
  [30.53995238, 114.3671286, "樱花大道"],
  [30.5404837, 114.3676704, "0"],
  [30.54074244, 114.3680245, "0"],
  [30.54095496, 114.3682659, "0"],
  [30.54115363, 114.3685555, "0"],
  [30.54127838, 114.3687916, "0"],
  [30.54143546, 114.3690652, "0"],
  [30.54145856, 114.3691993, "0"],
  [30.5414678, 114.3694729, "0"],
  [30.54143546, 114.3695962, "0"],
  [30.54136154, 114.3697679, "0"],
  [30.54130148, 114.3699503, "0"],
  [30.54125528, 114.3701756, "湖滨"],
  [30.54126452, 114.3704277, "0"],
  [30.5413061, 114.370594, "0"],
  [30.54135692, 114.3707711, "0"],
  [30.54063617, 114.3710822, "0"],
  [30.54010947, 114.3713504, "0"],
  [30.53981377, 114.3714255, "外语学院"],
  [30.53908377, 114.3715918, "法学院"],
  [30.53911149, 114.3721014, "0"],
  [30.53845541, 114.3721443, "经管院"],
  [30.53818281, 114.372198, "0"],
  [30.53761913, 114.372434, "0"],
  [30.53750824, 114.3724877, "0"],
  [30.53736039, 114.3725038, "0"],
  [30.53707855, 114.372493, "留学生院"],
  [30.53694456, 114.3724662, "0"],
  [30.53684291, 114.3724018, "0"],
  [30.5367967, 114.372139, "0"],
  [30.5367505, 114.3720585, "0"],
  [30.53669967, 114.3718654, "0"],
  [30.53668119, 114.3715489, "0"],
  [30.53670892, 114.3714041, "0"],
  [30.53680132, 114.3712431, "0"],
  [30.53686139, 114.3711948, "0"],
  [30.53690297, 114.371109, "0"],
  [30.53696304, 114.3707979, "0"],
  [30.53698152, 114.3705887, "0"],
  [30.53694918, 114.370299, "0"],
  [30.53687063, 114.3696606, "枫园十四舍"],
  [30.53680594, 114.3693602, "0"],
  [30.53666733, 114.3689793, "0"],
  [30.53651948, 114.3685234, "0"],
  [30.53646403, 114.3680781, "0"],
  [30.53651024, 114.3678367, "0"],
  [30.53660727, 114.3675148, "珞珈山庄"],
  [30.53666271, 114.3672895, "0"],
  [30.53674126, 114.3672949, "0"],
  [30.53706931, 114.3672842, "0"],
  [30.53719406, 114.3672734, "0"],
  [30.53750824, 114.3672037, "0"],
  [30.53769305, 114.3671769, "0"],
  [30.53784091, 114.3671393, "0"],
];
var GXB = [
  [
    [30.53649176, 114.3605036, 0],
    [30.53638087, 114.3604285, "教五楼"],
    [30.53637625, 114.3604338, 0],
    [30.53621915, 114.3603319, 0],
    [30.53598351, 114.3602085, 0],
    [30.53540596, 114.3599939, 0],
    [30.53515183, 114.3599188, 0],
    [30.53486998, 114.3598223, 0],
    [30.53482378, 114.3598115, 0],
    [30.53468054, 114.3597418, 0],
    [30.53444952, 114.3595648, 0],
    [30.53420925, 114.3593073, 0],
    [30.53408912, 114.3591249, 0],
    [30.53400595, 114.3590176, "校大门"],
    [30.53388119, 114.3589211, 0],
    [30.53392278, 114.3590659, "校大门"],
    [30.53406139, 114.3592697, 0],
    [30.53415842, 114.3594092, 0],
    [30.53430166, 114.3595541, 0],
    [30.53445414, 114.3596935, 0],
    [30.53462048, 114.3598115, 0],
    [30.53474523, 114.3598706, 0],
    [30.53494391, 114.3599564, 0],
    [30.53510563, 114.3600154, 0],
    [30.53535975, 114.3601066, 0],
    [30.53559077, 114.3601763, 0],
    [30.53581256, 114.3602514, 0],
    [30.53607592, 114.3603587, 0],
    [30.53613599, 114.3603909, 0],
    [30.5363208, 114.3605036, "教五楼"],
    [30.53643169, 114.3605733, 0],
    [30.53645017, 114.3605357, 0],
    [30.53649638, 114.3605089, 0],
    [30.53649176, 114.36050360,0],
    [30.53654258, 114.3604928, 0],
    [30.53652872, 114.3604392, 0],
    [30.53653334, 114.3603641, 0],
    [30.5365472, 114.3602997, 0],
    [30.53658416, 114.36023, 0],
    [30.53663499, 114.3601334, 0],
    [30.53675974, 114.3599617, 0],
    [30.53689373, 114.3597901, 0],
    [30.53693069, 114.3597472, 0],
    [30.53702772, 114.3596399, 0],
    [30.53706931, 114.3595916, 0],
    [30.53749438, 114.3591893, 0],
    [30.53773926, 114.3590122, 0],
    [30.53830756, 114.3586475, 0],
    [30.53839072, 114.3586099, 0],
    [30.53852933, 114.3585348, 0],
    [30.5389082, 114.3583041, "计算机学院"],
    [30.539227, 114.3581057, 0],
    [30.53929168, 114.3580574, 0],
    [30.53977219, 114.3577677, 0],
    [30.53982763, 114.3577194, 0],
    [30.54001706, 114.3576282, "桂园餐厅自强超市"],
    [30.54064079, 114.3574941, 0],
    [30.5408256, 114.3574888, 0],
    [30.54107047, 114.357596, 0],
    [30.54141236, 114.3577623, 0],
    [30.54146318, 114.3577838, 0],
    [30.54158793, 114.3578535, 0],
    [30.54162027, 114.3578482, 0],
    [30.54165723, 114.3584114, "明珠园"],
    [30.54172191, 114.3595862, "工学部校医二分院"],
    [30.54177736, 114.3609381, "世纪广场"],
    [30.54181432, 114.361496, 0],
    [30.5418097, 114.3616301, 0],
    [30.54182818, 114.3618822, 0],
    [30.5418328, 114.3621719, 0],
    [30.5419252, 114.3636686, 0],
    [30.5419252, 114.3639582, "网球场"],
    [30.54152325, 114.3640065, 0],
    [30.54163413, 114.365074, 0],
    [30.54168033, 114.3653584, 0],
    [30.54180508, 114.3663186, 0],
    [30.54184204, 114.3663937, 0],
    [30.54188824, 114.3664473, 0],
    [30.5419714, 114.3664473, 0],
    [30.54291391, 114.3663561, "工学部操场"],
    [30.5440643, 114.3661845, 0],
    [30.54427221, 114.3661577, 0],
    [30.54438771, 114.3661523, "洪波门"],
  ],
  [
    [30.54291391, 114.3663561, 0],
    [30.54291391, 114.3663508, 0],
    [30.54290005, 114.3661201, 0],
    [30.54283074, 114.3655086, 0],
    [30.5428215, 114.3653798, 0],
    [30.5427984, 114.3652618, 0],
    [30.54275682, 114.364779, 0],
    [30.5427291, 114.3645269, 0],
    [30.54266442, 114.3639261, 0],
    [30.5419252, 114.3639582, 0],
  ]
];
var DXH = [
  [30.526775, 114.35847, "信息学部二食堂"],
  [30.526779, 114.360536, 0],
  [30.52677, 114.361791, 0],
  [30.527056, 114.361791, "大学生活动中心"],
  [30.528595, 114.361802, 0],
  [30.52982, 114.361834, "信息学部青年楼"],
  [30.52981, 114.362199, 0],
  [30.529635, 114.362773, 0],
  [30.530453, 114.362805, "武大附中高中部"],
  [30.530647, 114.362918, 0],
  [30.530961, 114.363025, 0],
  [30.531566, 114.363266, 0],
  [30.532306, 114.363626, 0],
  [30.532818, 114.363894, 0],
  [30.533096, 114.364087, "文理学部东中区家属楼"],
  [30.533281, 114.363808, 0],
  [30.533438, 114.363626, 0],
  [30.533886, 114.363588, 0],
  [30.534255, 114.363534, 0],
  [30.534486, 114.363669, 0],
  [30.534584, 114.36377, 0],
  [30.534639, 114.363803, 0],
  [30.534741, 114.363942, 0],
  [30.534888, 114.364184, 0],
  [30.535055, 114.36443, 0],
  [30.535147, 114.364505, 0],
  [30.535249, 114.364591, 0],
  [30.535411, 114.364688, 0],
  [30.535535, 114.364774, 0],
  [30.535618, 114.364833, 0],
  [30.535762, 114.364902, "梅园食堂"],
  [30.535993, 114.365058, 0],
  [30.536141, 114.365321, 0],
  [30.536496, 114.366168, 0],
  [30.536603, 114.366839, 0],
  [30.536677, 114.367161, 0],
  [30.536663, 114.36729, 0],
  [30.536589, 114.36759, "珞珈山庄"],
  [30.53651, 114.367847, 0],
  [30.536473, 114.368073, 0],
  [30.536487, 114.368309, 0],
  [30.536519, 114.368507, 0],
  [30.536774, 114.369258, 0],
  [30.53682, 114.369451, 0],
  [30.536871, 114.369666, "枫园十四舍"],
  [30.536921, 114.370149, 0],
  [30.536945, 114.370304, 0],
  [30.536982, 114.370546, 0],
  [30.536958, 114.370798, 0],
  [30.536912, 114.371109, 0],
  [30.536852, 114.3712, 0],
  [30.536815, 114.371227, 0],
  [30.536709, 114.371393, 0],
  [30.53669, 114.371533, 0],
  [30.536686, 114.371774, 0],
  [30.536746, 114.372048, 0],
  [30.536797, 114.372144, 0],
  [30.536843, 114.372396, 0],
  [30.53694, 114.372455, 0],
  [30.537088, 114.372493, "留学生院"],
  [30.53736, 114.372498, 0],
  [30.537088, 114.372493, 0],
  [30.537517, 114.372477, 0],
  [30.538164, 114.372198, 0],
  [30.538492, 114.372139, "经管学院"],
  [30.539111, 114.372101, 0],
  [30.539098, 114.371844, "法学院"],
  [30.539088, 114.371592, 0],
  [30.539837, 114.371409, "外语学院"],
  [30.5401, 114.37135, 0],
  [30.540627, 114.371082, 0],
  [30.541357, 114.370776, 0],
  [30.541265, 114.370428, 0],
  [30.541246, 114.370278, "湖滨食堂"],
  [30.541255, 114.370176, 0],
  [30.541265, 114.370025, 0],
  [30.541362, 114.369773, 0],
  [30.541445, 114.36958, 0],
  [30.541468, 114.369489, 0],
  [30.541459, 114.369205, 0],
  [30.541449, 114.369124, 0],
  [30.541435, 114.369071, 0],
  [30.541255, 114.368738, 0],
  [30.541163, 114.368561, 0],
  [30.540904, 114.368212, 0],
  [30.540742, 114.368019, 0],
  [30.540742, 114.368019, 0],
  [30.540484, 114.367665, "社科院"],
  [30.540562, 114.366404, 0],
  [30.540807, 114.365498, 0],
  [30.541186, 114.364618, 0],
  [30.541135, 114.364243, 0],
  [30.541158, 114.364119, 0],
  [30.541237, 114.364044, 0],
  [30.541325, 114.364012, 0],
  [30.541537, 114.364001, 0],
  [30.54193, 114.363953, "工学部网球场"],
  [30.541791, 114.360981, "一站式学生事务与发展中心"],
  [30.541662, 114.358529, "明珠园"],
  [30.54162, 114.357848, 0],
  [30.541583, 114.357848, 0],
  [30.540909, 114.357521, 0],
  [30.540807, 114.357489, 0],
  [30.540696, 114.357489, 0],
  [30.540613, 114.357505, 0],
  [30.5401, 114.357612, "自强超市"],
  [30.540645, 114.357499, 0],
  [30.540026, 114.357623, 0],
  [30.539823, 114.357725, 0],
  [30.539781, 114.357757, 0],
  [30.539786, 114.357752, 0],
  [30.53888, 114.35832, "计算机学院"],
  [30.5384, 114.358605, 0],
  [30.538312, 114.358642, 0],
  [30.537739, 114.359007, 0],
  [30.537522, 114.359173, 0],
  [30.537088, 114.359581, 0],
  [30.53663, 114.360128, 0],
  [30.536529, 114.360332, 0],
  [30.536543, 114.360498, 0],
  [30.536487, 114.360504, 0],
  [30.536422, 114.360455, "教五楼"],
  [30.536224, 114.360321, 0],
  [30.535697, 114.36009, 0],
  [30.535401, 114.359989, 0],
  [30.534815, 114.359806, 0],
  [30.534676, 114.359726, 0],
  [30.534408, 114.359517, 0],
  [30.534223, 114.359313, 0],
  [30.534011, 114.359012, "校大门"],
  [30.533872, 114.358905, 0],
  [30.533752, 114.35905, 0],
  [30.533562, 114.359044, 0],
  [30.533091, 114.358701, 0],
  [30.532897, 114.358492, 0],
  [30.532597, 114.357972, 0],
  [30.532527, 114.357778, 0],
  [30.532102, 114.357569, 0],
  [30.531982, 114.357596, 0],
  [30.531354, 114.35736, 0],
  [30.530245, 114.357778, 0],
  [30.530217, 114.357778, 0],
  [30.529482, 114.357768, "信息学部游泳池"],
  [30.527708, 114.357762, 0],
  [30.527043, 114.357677, "国际软件学院"],
  [30.526867, 114.357655, 0],
  [30.526775, 114.35847, 0],
];

var SCHOOLS_M = [
  [30.53678284, 114.3665922, "哲学学院", "武汉大学哲学学院（Wuhan University School of Philosophy），是中国最有影响的哲学院系之一，综合实力和整体水平在全国各类评估中名列前茅，也是国际知名大学哲学院系。截至2016年5月，在国际QS排名中，均为世界前100名大学哲学院系。20世纪初期，众多著名哲学家，如熊十力、方东美、洪谦、朱光潜等人在这里任教。中国共产党创始人之一李达先生，曾任恢复重建的哲学系系主任，并为20世纪后叶哲学学科的发展奠定了新的基础。", "http://wx2.sinaimg.cn/mw1024/86ede6e5ly1fgn5k116lyj20m80gogq4.jpg"],
  [30.53701386, 114.3668067, "国学院", "武汉大学国学院成立于2010年6月25日，是国内少数几个具有国学本科、硕士、博士完整培养体系的教学研究单位，武大自2001年起，联合哲、历史、文学、艺术等多学科力量，在国内率先创办国学本科试验班；2005年开始招收国学方向的研究生。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5k22lbej20m80godm1.jpg"],
  [30.53891282, 114.3678528, "文学院", "武汉大学文学院的前身是1893年张之洞在自强学堂设置的“汉文门”，1928年国立武汉大学成立时正式命名为文学院，闻一多担任院长。沈从文、朱光潜、郁达夫、叶圣陶、王蒙等知名学者曾先后在该院任教，学院下辖中国文学系、汉语言文化系、大学语文部、古籍整理研究所、《长江学术》杂志社、《写作》杂志社、院党政办公室、资料室、武汉大学中国语言文学实践教学中心、武汉大学普通话培训与测试工作站等机构。设有汉语言文学、对外汉语和人文科学试验班﹑国学班（与历史学院﹑哲学学院合办）等本科专业。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5k2akkbj20m80godiy.jpg"],
  [30.53946725, 114.3710446, "外国语言文学学院", "武汉大学外国语言文学学院是我国中部地区综合性大学中外语学科门类最为齐全的外语学院之一，有武汉大学人文社会科学重点研究基地“法国问题研究中心”和“法语国家研究中心”。还拥有全国唯一研究法国经济、政治、法律、文学、文化等情况的、面对国内外公开发行的《法国研究》学术杂志。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5k30pmaj20m80gotd1.jpg"],
  [30.53982763, 114.367606, "新闻与传播学院", "武汉大学的新闻传播教育始于改革开放之初，学院前身为1983年组建的原武汉大学新闻系。学院下设新闻学、广播电视、广告、广告设计、传播学、播音与主持艺术等六个本科专业和专业方向；拥有新闻传播学一级学科博士学位授予权，五个子学科博士学位授权点：新闻学、传播学、广告学、跨文化传播学、媒介经营与管理；一个新闻传播学博士后流动站；拥有一个教育部人文社会科学重点研究基地——武汉大学媒体发展研究中心，一个“985工程”国家哲学社会科学创新基地——新闻传播与媒介化社会创新基地；一个湖北省省级重点学科——新闻学。", "http://wx2.sinaimg.cn/mw1024/86ede6e5ly1fgn5k3p3rhj20m80go0wy.jpg"],
  [30.53505942, 114.377144, "艺术学院", "武汉大学艺术学系成立于2003年8月，是学校独立建制的直属系之一。艺术学系设置有戏剧戏曲、影视、表演和艺术基础理论教研室，拥有一个博士点：戏剧影视文学博士点；三个硕士点：戏剧戏曲学、电影学、艺术学硕士点；两个本科专业：戏剧影视文学专业和表演专业。建有表演艺术研究所和表演实验艺术团。著名校友包括：吴倩、黄灿灿等。", "http://wx2.sinaimg.cn/mw1024/86ede6e5ly1fgn5k4gyrdj20m80godlf.jpg"],
  [30.53936561, 114.3677562, "历史学院", "武汉大学历史学科创建于1913年，是我国高等院校中较早成立的历史系科之一，有着悠久历史和深厚积淀。著名学者李剑农、谭戒甫、吴其昌、杨人楩、唐长孺、吴于廑、姚薇元、方壮猷、石泉等史学名家先后在这里执教，严耕望、陈仲安、高敏、张泽咸、谢桂华、彭泽周（伊原泽周）、张海鹏等知名学者在这里毕业。经过几代学人的不断努力和积极开拓，形成了严谨的学风和优良的教风，确立了理论探讨与实证研究相统一，断代史与专门史、地区史与国别史相结合，传世文献与出土文献并重等学术特色，在队伍建设、科学研究和人才培养等方面成果突出，在国内外同行中具有重要地位和影响，具备雄厚的学科优势和科研实力。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5k4rpe2j20m80goq5n.jpg"],
  [30.5389775, 114.3731904, "经济与管理学院", "武汉大学经济与管理学院是武汉大学的二级学院，据2017年3月学校官网显示，武汉大学经济与管理学院是武汉大学办学规模最大的学院。学院前身可追溯到1893年清末湖广总督张之洞创办自强学堂时设立的商务门，其实体根基源自1916年设立的国立武昌商业专门学校。1928年国立武汉大学设经济学系。1981年经济学系与经济管理系分设，1999年经济学院、管理学院和旅游学院合并为商学院。2001年原武汉大学商学院、原武汉水利电力大学经济管理学院与原武汉测绘科技大学经济管理、市场营销教研室合并组建新武汉大学商学院，2005年更名为经济与管理学院。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5k5e5soj20m80gowhi.jpg"],
  [30.53882965, 114.371227, "法学院", "武汉大学法学学科源远流长，是中国著名的“五院四系”成员。武大法学学科最早可追溯到1908年创办的湖北法政学堂。1911年辛亥革命后改为湖北公立法政专门学校，1926年武昌中山大学成立，1928年改组成立国立武汉大学，法学院都是其中的重要院系。当时先后云集燕树棠、王世杰、皮宗石、周鲠生、梅汝璈等一大批著名法学家，办学声誉影响海内外。1979年恢复法律系，1986年成立法学院后，先后有著名法学家韩德培教授、著名刑法学家马克昌教授、知名民商法专家马俊驹教授、知名国际法专家余劲松教授、曾令良教授出任系主任和院长，现任院长是冯果教授[1]  。经过三十多年的恢复重建与发展，法学院已成为中国法学教育与研究的一方重镇。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5kq3nhdj20m80go0wu.jpg"],
  [30.53796103, 114.367488, "马克思主义学院", "武汉大学是我国最早的研究和传播马克思主义的重要阵地。20世纪50年代初期建立马克思主义教研室，20世纪80年代设立马克思主义理论基础教学部。后在政治与行政学院、政治与公共管理学院内发展，2011年7月，学校成立独立的马克思主义学院。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5l1yel5j20m80gotaz.jpg"],
  [30.53420925, 114.357816, "社会学系", "早在20世纪20年代，武汉大学就先后开设社会学课程、设立社会学专业。我国著名学者李达、李汉俊等教授先后在武汉大学讲授社会学课程。1952年院系调整后，社会学专业停办。1979年以来，随着我国社会学学科的恢复与重建，武汉大学是率先恢复社会学教学、重建社会学专业的全国10所高校之一。1983年在武汉大学哲学系建立社会学教研室，开始在全校开设社会学课程。1986年原国家教委批准武汉大学建立社会学专业，同年开始招收本科生。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5l2b8vzj20m80go0vg.jpg"],
  [30.53852009, 114.3674988, "政治与公共管理学院", "武汉大学政治与公共管理学院历史悠久，学术积淀较为深厚。其中政治学学科的历史最早可追溯到20世纪20年代，马克思主义理论学科始建于20世纪60年代初。新兴的公共管理学科起步于20世纪80年代中期，均为全国同类学科建设最早的单位之一。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5l2lra1j20m80gotaz.jpg"],
  [30.54281688, 114.3600798, "教育科学研究院", "秉承武汉大学百余年来积淀而成的优良学风，武汉大学教育科学研究院在原高等教育研究所的基础上，于2003年7月成立。研究院设有高等教育学研究所、教育经济与管理研究所、教育学原理研究所、课程与教学论研究所、教育技术学研究所，以及教育学系、教育法学研究中心、研究生教育研究中心、教育科学研究评价中心、教育领导研究中心、班主任研究中心、武汉大学高等教育学会秘书处、武汉大学保卫科学研究所等机构；现有教育经济与管理博士点，高等教育学、教育经济与管理、课程与教学论、教育学原理4个硕士点以及教育硕士、工程硕士（基于计算机技术领域开发的教育技术方向）2个专业学位点；现有教职工33人，其中教授9人，副教授8人，讲师6人，具有博士学位教师16人，并有一批国内外教育学知名学者及专家受聘为学院兼职教授或兼职研究员；现有各类学生近350人，其中全日制博士研究生22人，硕士研究生90人（含全日制工程硕士研究生19人、单考双证硕士研究生班学生25人），高校教师在职攻读硕士学位研究生70人，工程硕士（教育技术方向）研究生19人，博士、硕士研究生课程班学生143人。学院本着“人才强院、学术立院、民主建院、依法治院”的精神，紧扣时代脉搏，瞄准世界前沿，推进学科建设，加大教育教学改革力度，突出综合性大学办教育学院的优势，强化武大特色，以学科建设为龙头，以创新为灵魂，促进教学、科研与咨询服务上质量、上水平；培养有深厚人文底蕴，有先进教育思想的创新人才；营造良好的学术氛围，促进教育学科与其他学科的交叉互动；开展教育理论创新，积极创建有中国特色的现代教育理论体系。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5l3f1hqj20m80go79j.jpg"],
  [30.53661189, 114.3752825, "信息管理学院", "武汉大学信息管理学院是中国历史最悠久、规模最大的信息管理教育与研究机构，其前身是美国学者韦棣华和中国第一位图书馆学留学生沈祖荣先生于1920年创办的武昌文华大学图书科，1929年独立为武昌文华图书馆专科学校。1953年武昌文华图书馆专科学校并入武汉大学，更名为武汉大学图书馆学系，1956年建立图书馆学本科专业，1984年经教育部批准建立图书情报学院，2001年更名为信息管理学院。该院设有图书馆学、信息管理与信息系统、档案学、编辑出版学、电子商务、数字出版6个本科专业，7个硕士和博士点，两个一级学科博士学位授权点和一个博士后流动站。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5l3sycoj20m80go784.jpg"],
  [30.53737887, 114.3744242, "国际教育学院", "武汉大学国际教育历史悠久，从20世纪50年代起就开始接收外国留学生，是我国最早接收外国留学生的院校之一。五十多年来，武汉大学留学生教育规模不断扩大，先后有来自世界110多个国家和地区的数千名留学生在校学习和生活，学校已逐步发展成为我国中西部最大的国际学生留学目的地之一。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5l4ja3bj20m80gotcj.jpg"],
  [30.53995238, 114.3646932, "数学与统计学院", "武汉大学数学与统计学院是武汉大学历史最悠久的单位之一。1893年武汉大学前身“自强学堂”创办时就有“算学门”，国立武昌高等师范学校组建后于1914年设立“数学物理部”并于1917年改名为“数学理化部”，1922年学校改四部为八系时成立“数学系”，1998年3月数学系升格为“数学科学学院”，1999年4月校内合院改名为“数学与计算机科学学院”，四校合并为新武汉大学后于2001年1月再改名为“数学与统计学院”。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5l4yhh8j20m80go0vs.jpg"],
  [30.53421849, 114.3621129, "物理科学与技术学院", "武汉大学物理科学与技术学院是在1928年成立的原武汉大学物理系的基础上逐渐发展、演变而来。其历史可追溯到1893年自强学堂的格致门。我国老一辈著名物理学家查谦、潘祖武、汪仁寿、桂质廷、吴南熏、马师亮、李国鼎、周如松等先后在这里研究执教多年。经过近八十年、几代人的努力，现已发展成为涵盖物理学、材料科学与工程、电子科学与技术、生物医学技术四个学科门类，多个有突出特色的学科研究方向，在国际国内有一定影响，我国最有名望的物理院系之一。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5l5ltddj20m80goq6f.jpg"],
  [30.5364779, 114.3597418, "化学与分子科学学院", "武汉大学化学与分子科学学院是我国建立最早的化学院、系之一。她的历史可以追溯到1893年（光绪十九年）湖广总督张之洞在汉阳炼铁厂建立的化学学堂。1896年化学学堂并入湖北自强学堂的格致门，后改为化学门。1913年国立武昌高等师范成立，设数学理化部。1928年国立武汉大学组建，正式定名为武汉大学理工学院化学系，王星拱教授担任化学系首任系主任。1953年全国进行院校调整，湖南大学化学系和南昌大学化学系并入武汉大学化学系。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5l6i8sbj20m80goqae.jpg"],
  [30.53302639, 114.3607825, "生命科学学院", "武汉大学生命科学学院历史悠久，可以追溯到1893年武汉大学建校之1922年成立生物学系，1978年成立病毒学系， 1992年生物学系、病毒学系和生物工程中心合并成立生命科学学院。经过历代师生员工的努力，特别是一批学术造诣深、治学严谨、国内外知名的高水平生物学家，如汤佩松、何定杰、舒红兵等在此辛勤耕耘，使学院成为学科门类齐全，综合实力较强，在国内外有较大影响的研究型学院。长期以来，学院形成了求真务实、开拓创新的优良院风和学风，现任院长宋保亮。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5lp4dttj20m80goq7b.jpg"],
  [30.52551768, 114.3601656, "资源与环境科学学院", "武汉大学资源与环境科学学院是一个集工科、理科与管理类专业于一体的综合性学院，由原武汉测绘科技大学土地科学学院、原武汉大学环境科学与工程系和原武汉水利电力大学化学与环境工程系环境工程专业于2001年1月3月合并组建而成。武汉大学资源与环境科学学院横跨测绘科学与技术、地理学、环境科学与工程、公共管理4个一级学科，是一个多学科交叉的综合性学院。拥有2个国家级重点学科（地图学与地理信息系统、地图制图学与地理信息工程）；2个湖北省一级重点学科（地理学、环境科学与工程）,1个湖北省二级重点学科（土地资源管理）；7个硕士点和7个博士点（地图学与地理信息系统、地图制图学与地理信息工程、环境科学、环境工程、土地资源管理、人文地理学、自然地理学）；6个本科专业；1个国家理科人才培养基地；拥有和共享4个一级学科博士点和博士后流动站；4个省部级重点实验室和工程研究中心现有本科生1400余名，硕士研究生近400人，博士研究生120余人。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5lpszixj20m80gotde.jpg"],
  [30.5255454, 114.3619412, "高等研究院", "武汉大学高等研究院（The Institute for Advanced Studies of Wuhan University）（简称高研院IAS）为直属武汉大学相对独立运行的科研机构，成立于2014年4月，中国科学院院士朱玉贤教授担任首任院长。高等研究院以武汉大学雄厚的基础学科为基础，发挥多学科优势，将建成学科交叉研究的基地、高水平研究人才的特区、科研资源共享和国际学术交流的平台。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5lq6f78j20m80gowia.jpg"],
  [30.54484047, 114.3631697, "动力与机械学院", "武汉大学动力与机械学院（School of Power and Mechanical Engineering, Wuhan University）是以能源动力工程学科群为基础的工科学院，是中国能源动力及其装备行业重要的人才培养和科学研究基地。1933年武汉大学工学院设立机械工程系，1952年武汉大学成立水利学院，1953年武汉大学工学院机械系从武汉大学分离，组建华中工学院，1954年 武汉大学水利学院从武汉大学分离，成立武汉水利学院，1958年武汉水利学院更名武汉水利电力学院，1993年武汉水利电力学院更名为武汉水利电力大学，2000年新武汉大学成立，武汉水利电力大学动力与机械工程学院、武汉测绘科技大学机械学科合并组建成为武汉大学动力与机械学院。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5lqst2aj20m80gowhi.jpg"],
  [30.54398114, 114.3631589, "电气工程学院", "武汉大学电气工程学院始建于1959年，是原国家电力部重点建设学院之一，被誉为我国电力工程高级人才培养的摇篮，在国内外电气工程领域享有很高的知名度。", "http://wx2.sinaimg.cn/mw1024/86ede6e5ly1fgn5lrb7zmj20m80go0wk.jpg"],
  [30.54186976, 114.3590015, "城市设计学院", "城市设计学院是由原武汉大学、武汉水利电力大学、武汉测绘科技大学的建筑学、城市规划、艺术设计、图学中心等专业和教学单位于2000年12月合并而成。2003年，学校将工业设计专业从其他院系调整到城市设计学院，学院因此形成规划设计、建筑设计、工业设计、艺术设计相辅相成的完备设计体系。依托学校文、史、哲、经、法、管、理、工、农、医、教育等多学科基础，借助学校深厚的学术氛围和人文底蕴，学院在专业上逐步形成人文化、数字化、国际化和创意产业化的办学特色。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5ls3jsuj20m80gotfq.jpg"],
  [30.54182356, 114.3586797, "土木建筑工程学院", "武汉大学土木建筑工程学院为武汉大学二级学院，是2000年8月新武汉大学组建后，由原武汉水利电力大学土木与建筑学院、原武汉测绘科技大学城市建设学院的相关学科组建而成。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5lsnurrj20m80godka.jpg"],
  [30.5425905, 114.3624401, "水利水电学院", "武汉大学水利水电学院源于1952年武汉大学水利学院。2000年12月，新武汉大学组建后由原武汉水利电力大学的水利工程系、水力发电工程系、水资源与河流工程系及水利水电科学研究所整合组成。经过五十多年的建设与发展，学院现已成为综合实力突出、享誉国内外的水利水电高级人才培养的摇篮和科学研究的重要基地。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5lt6nc0j20m80gowho.jpg"],
  [30.53799338, 114.3585563, "电子信息学院", "武汉大学电子信息学院（School of Electronic Information of Wuhan University）源于1945年建立 武汉大学信息学部的原国立武汉大学游离层实验室。2000年新武汉大学组建后，由原武汉大学电子信息学院、分析测试中心测控技术与仪器专业、原武汉测绘科技大学光电工程学院和原武汉水利电力大学计算机系测控技术与仪器专业组成。", "http://wx2.sinaimg.cn/mw1024/86ede6e5ly1fgn5ltmom6j20m80gon17.jpg"],
  [30.53881117, 114.3580359, "计算机学院", "武汉大学计算机学院成立于2001年元月3日，它由原武汉大学、原武汉水利电力大学、原武汉测绘科技大学计算机系合并而成。2010年1月11日，新的武汉大学计算机学院由原武汉大学计算机学院、软件工程国家重点实验室、国家多媒体软件工程技术研究中心和武汉大学计算中心整合而成。其历史可以追溯到1978年原武汉大学建立的计算机科学系，是全国最早建立计算机科学院系的单位之一。学院坚持“依法治院、质量立院、特色兴院、人才强院、和谐建院”的办学理念，致力于建设研究型、开放式、国际化的国内外知名计算机学院。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5mm4odsj20m80gojuc.jpg"],
  [30.52746307, 114.3568826, "国际软件学院", "武汉大学国际软件学院是教育部、国家计委首批批准成立的国家示范性软件学院，是为了适应我国经济结构战略性调整的要求和软件产业发展对人才的迫切需要而建立的，旨在为我国软件产业发展带来新的推动力，支持国家“以信息化带动工业化”的战略部署，培养复合型、实用型、国际化的高层次软件人才。学院按国际通行 办学模式组织教学活动，实施社会化的管理。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5mmyjayj20m80gomzm.jpg"],
  [30.52602136, 114.3619895, "测绘学院", "武汉大学测绘学院的前身是1956年成立的原武汉测量制图学院。学院位于江城武汉，学院创建50年来，锐于改革， 勇于创新，积极大力推进教学、科研、社会服务等工作，取得了一大批服务于国家经济和国防建设等领域的重大成果，培养了一大批中国测绘事业的领军人物，学院始终按照“高品质、国际化、创新型”的办学理念，大力推进学院发展。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5mnk7joj20m80goafw.jpg"],
  [30.52587349, 114.3601763, "遥感信息工程学院", "武汉大学遥感信息工程学院是集遥感、测绘、空间信息工程技术于一体的信息和工程类学院。 几年来，在“211”工程和“985”工程支持下，先后建立了具有世界先进水平的科研和教学环境，基本建成航天、航空、低空、地面立体数据采集体系，取得了一批有重大影响的研究成果。", "http://wx2.sinaimg.cn/mw1024/86ede6e5ly1fgn5mo4chwj20m80goq79.jpg"],
  [30.52642337, 114.3600637, "印刷与包装系", "武汉大学印刷与包装系是武汉大学的直属系，创建于 1983 年，同年设立印刷工程本科专业， 1995 年在印刷工程专业基础上开设电子出版专业方向； 1993 年增设包装工程专业； 1995 年经国务院批准，获印刷工程硕士学位授予权。“九五”期间，印刷工程学科进入国家“211工程”重点学科，2002 年本系开始招收图像与动画设计专业硕士研究生，2004 年获包装科学与技术硕士学位授予权，2005 年获图像传播工程博士学位授予权。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5mofhy3j20m80go0w4.jpg"],
  [30.5540939, 114.3544257, "医学研究院", "武汉大学医学研究院（Medical Research Institute, Wuhan University）成立于2014年4月，坐落于武汉大学医学部的双湖综合实验大楼，总面积约13000㎡，由武汉大学副校长舒红兵院士兼任首任院长。武汉大学医学研究院是武汉大学高水平人才的科研创新特区，发展目标是聚集高水平的科研队伍，整合学科资源优势，促进生命科学和临床医学的结合与转化研究，进一步提升武汉大学医学和生命科学的学术实力，建设具有国际影响的高水平医学研究基地。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5mp996tj20m80go0xp.jpg"],
  [30.55410314, 114.3557239, "基础医学院", "经历六十多年变迁，特别是四校合并以来，武汉大学基础医学院已发展成为集教学、科研、社会服务于一体的医学高级专业人才培养的重要基地。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5mqf6rij20m80goaep.jpg"],
  [30.55322542, 114.3561745, "健康学院", "武汉大学健康学院于2016年7月由原公共卫生学院（2001年）和HOPE护理学院（2002年）合并成立。是我国公共卫生与预防医学、全球健康学以及护理学高级专门人才培养的重要基地之一。", "http://wx2.sinaimg.cn/mw1024/86ede6e5ly1fgn5mqz4blj20m80go0x4.jpg"],
  [30.53518879, 114.2961144, "第一临床医学院", "武汉大学第一临床学院早起源于1923年湖北省立医科大学实习医院。1928年，武昌中山大学更名为武汉大学时医科分离，实习医院扩充后成立湖北省立医院。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5mrioqfj20m80go78q.jpg"],
  [30.55333629, 114.3545866, "第二临床医学院", "武汉大学第二临床学院即武汉大学中南医院。武汉大学中南医院成立于2000年8月2日，总部位于武汉市；建筑面积27.9万平方米，卫生厅核定批准床位3300张，进入全国特大型医院行列。医院学科齐全，有46个临床医技科室，20个教研室，2500平方米医学科学研究中心。医院承担武汉大学临床医学、医学检验等专业本科生、七年制学生以及港、澳、台地区学生和20多个国家留学生的临床课程教学，同时承担博、硕士研究生的教育任务。武汉大学中南医院一直以“特色兴院、科技强院”为战略目标，通过科技创新不断完善科研管理办法和科研评价体系，充分调动广大医务人员科研工作积极性，通过全院不懈努力，科研实力不断增强，科研能力逐年提高，医院在科学研究、人才培养、学科平台建设和国内外合作交流等方面取得显著的成效。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5my34rfj20m80go41z.jpg"],
  [30.52258335, 114.365294, "口腔医学院", "武汉大学口腔医学院的前身是湖北医科大学口腔医学院，始建于1960年，是新中国依靠自己的力量建立的第一所口腔系。2000年8月2日经国务院批准，原武汉大学、武汉水利电力大学、武汉测绘科技大学与湖北医科大学组成新的武汉大学。口腔医学院现拥有口腔医学一级学科博士学位授予权，是口腔医学博士后流动站设站单位，设有教育部口腔生物医学工程重点实验室，口腔基础医学为国家重点学科。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5myoib8j20m80goq6h.jpg"],
  [30.5552765, 114.3566787, "药学院", "武汉大学药学院，是新武汉大学组建之后，为满足中国国民经济和药学事业的发展对高级药学人才（理论基础扎实，知识面宽，实践能力强）的迫切需求，在整合已有物质设备的基础上，由原生命科学学院药学系、医学院（原湖北医科大学）药学系、化学与分子科学学院及人民医院（原湖北医科大学附属第一医院）药学部从事相关教学与科研的师资汇集而成。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5mzce0pj20m80goadr.jpg"],
  [30.53598351, 114.2936468, "医学职业技术学院", "武汉大学医学职业技术学院位于驰名中外的扬子江畔，雄伟壮观的黄鹤楼南侧，始建于 1939 年，前身为 “ 湖北省立武昌医院护校 ” 。 1999 年更名为湖北医科大学职业技术学院，经省教育厅首次批准承办高等职业教育， 2000 年新武汉大学成立后曾经更名为武汉大学医学院职业技术学院。2010年12月经湖北省人民政府、武汉大学双方协议，学院整体、实质性并入武汉大学，2011年7月经武汉大学批准更名为武汉大学医学职业技术学院。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5mzoa6hj20m80gojua.jpg"],
  [30.55407542, 114.3569255, "医学部机关", "武汉大学医学部源于1943年成立的湖北省省立医学院，现在是武汉大学六大学部之一。学部含基础医学院、第一临床学院、第二临床学院、口腔医学院、药学院、健康学院、职业技术学院、A3实验室、医学研究院；有武汉大学人民医院、武汉大学中南医院、武汉大学口腔医院、武汉大学附属亚心医院（亚心临床学院）、武汉大学附属同仁医院（同仁临床学院）、武汉大学武汉总医院临床学院（军民融合发展中心）、武汉大学恩施临床学院、武汉大学医学部附属中山医院（临床学院）共8所附属医院（临床学院）。设有临床医学（五年制、“5+3”、八年制）、口腔医学（五年制、“5+3”、八年制）、预防医学、医学检验、药学、生物制药、护理学、全球健康、基础医学等招生专业。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5mzxt44j20m80goq5c.jpg"],
];

var SCHOOLSGATE_M = [
  [
    [30.55178871, 114.3557668, "杏林门", "开放时间：24小时</br>校外车辆可自由通行。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5idk7usj20m80goq5v.jpg"],
    [30.54533481, 114.3603748, "文澜门", "开放时间：24小时</br>校外车辆可自由通行。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5ie8tyvj20m80go78r.jpg"],
    [30.53928244, 114.354313, "茶港门", "开放时间：24小时</br>校外车辆可自由通行。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5iehpvbj20m80go42p.jpg"],
    [30.53540596, 114.3566734, "西门", "开放时间：24小时</br>校外车辆可自由通行。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5if7wxrj20m80gon04.jpg"],
  ],
  [
    [30.54507147, 114.3621075, "北门", "开放时间：无</br>施工中不可通行。", "http://wx2.sinaimg.cn/mw1024/86ede6e5ly1fgn5ifog82j20m80gowha.jpg"],
    [30.54547803, 114.3660128, "洪波门", "开放时间：6:30-22:00</br>禁止车辆通行。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5ig3dnmj20m80go41h.jpg"],
    [30.54338516, 114.3706101, "凌波门", "开放时间：7:00-20:30</br>禁止车辆通行。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5igr8mrj20m80go789.jpg"],
    [30.53517031, 114.3773532, "东门", "开放时间：7:00-22:00</br>校外车辆不可通行。", "http://wx2.sinaimg.cn/mw1024/86ede6e5ly1fgn5ih7ws7j20m80gowid.jpg"],
    [30.53284157, 114.3574136, "正门", "开放时间：24小时</br>校外车辆不可通行。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5ihhgzaj20m80go410.jpg"],
    [30.53091477, 114.3630034, "中东区南门", "开放时间：6-24:00</br>校外车辆不可通行。", "http://wx2.sinaimg.cn/mw1024/86ede6e5ly1fgn5iq0z32j20m80go774.jpg"],
    [30.53027249, 114.3652028, "南一门", "开放时间：24小时</br>校外车辆不可通行。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5iqp3z0j20m80gowjg.jpg"],
    [30.52500475, 114.361158, "南门", "开放时间：24小时</br>校外车辆不可通行。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5ir6p2yj20m80gogos.jpg"],
  ],
  [
    [30.52973187, 114.3678367, "南三门", "开放时间：6-23:30</br>校外车辆可以驶入，但禁止使出。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5irfnycj20m80gojt8.jpg"],
  ]
];

var JIUYE_M = [
  [30.52838261, 114.3592697, "武汉大学学生就业指导与服务中心", "武汉大学学生就业指导与服务中心(以下简称“中心”)成立于2013年9月。中心是在学校就业工作领导小组的指导下，贯彻落实国家大学生就业工作方针政策，行使在校学生就业服务、指导、教育和管理职能的部门。</br>中心设立了就业信息与市场开拓办公室、就业指导与咨询办公室、就业管理办公室和综合办公室四个部门。</br>学生就业指导与服务中心完成学生毕业和就业的相关工作，内容包括：根据国家各项方针、政策以及学校有关要求，制定毕业生就业工作意见及实施细则，充分宣传各项相关政策;主动向社会各界发布毕业生信息，深入挖掘社会需求，收集并以多种形式及时发布各类用人单位需求;组织校园宣传及招聘活动;开展就业咨询及指导;办理就业协议签订事宜，形成毕业生就业方案，完成上级部门各类业务工作;负责毕业生派遣和学生档案管理相关事宜;开展各类调查研究，组织科研课题项目完成等。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5dqz55hj20m80goq7a.jpg"],
  [30.53763299, 114.3665332, "行政楼", "武汉大学行政楼为武大早期著名建筑之一，由建筑美国工程师开尔斯等设计，上海六合营造公司中标承建，1934年11月开工，1936年1月竣工，建筑面积8140平方米，造价40万元，其中由管理中英庚款董事会资助12万元。竣工不到三年，就被日寇侵占，成为日军的医院。1952年全国院系调整后，武汉大学工学院被撤销，学校便将工学院大楼改作办公大楼，并一直使用至今日。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5dp44hoj20m80goq6v.jpg"],
  [30.53904681, 114.3673378, "武汉大学生就业市场武大分市场", "武汉大学生就业市场是华中地区唯一的国家级区域性人才市场，经过十多年快速发展，已经成为我国中部最大的人才资源服务机构。每年举办各类现场招聘会近百场，进场招聘单位近万家，进场择业人员达50余万人次；", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5dpqmysj20m80gon0i.jpg"],
  [30.52786046, 114.36001, "武汉大学生就业市场综合厅", "武汉大学生就业市场是华中地区唯一的国家级区域性人才市场，经过十多年快速发展，已经成为我国中部最大的人才资源服务机构。每年举办各类现场招聘会近百场，进场招聘单位近万家，进场择业人员达51余万人次；", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5dqf05zj20m80gojvh.jpg"],
];

var BAOGAOTING_M = [
  [30.53339604, 114.360863, "生命科学学院学术报告厅", "武汉大学生命科学学院历史悠久，可以追溯到1893年武汉大学建校之1922年成立生物学系，1978年成立病毒学系， 1992年生物学系、病毒学系和生物工程中心合并成立生命科学学院。经过历代师生员工的努力，特别是一批学术造诣深、治学严谨、国内外知名的高水平生物学家，如汤佩松、何定杰、舒红兵等在此辛勤耕耘，使学院成为学科门类齐全，综合实力较强，在国内外有较大影响的研究型学院。长期以来，学院形成了求真务实、开拓创新的优良院风和学风，现任院长宋保亮。", "http://wx3.sinaimg.cn/mw1024/86ede6e5gy1fgn5b1gxcfj20m80gowiv.jpg"],
  [30.5363439, 114.3593287, "化学与分子科学学院报告厅（创隆厅）", "武汉大学化学与分子科学学院是我国建立最早的化学院、系之一。她的历史可以追溯到1893年（光绪十九年）湖广总督张之洞在汉阳炼铁厂建立的化学学堂。1896年化学学堂并入湖北自强学堂的格致门，后改为化学门。1913年国立武昌高等师范成立，设数学理化部。1928年国立武汉大学组建，正式定名为武汉大学理工学院化学系，王星拱教授担任化学系首任系主任。1953年全国进行院校调整，湖南大学化学系和南昌大学化学系并入武汉大学化学系。", "http://wx2.sinaimg.cn/mw1024/86ede6e5gy1fgn5azopp9j20m80gojyu.jpg"],
  [30.53432014, 114.3622738, "物理科学与技术学院报告厅", "武汉大学物理科学与技术学院是在1928年成立的原武汉大学物理系的基础上逐渐发展、演变而来。其历史可追溯到1893年自强学堂的格致门。我国老一辈著名物理学家查谦、潘祖武、汪仁寿、桂质廷、吴南熏、马师亮、李国鼎、周如松等先后在这里研究执教多年。经过近八十年、几代人的努力，现已发展成为涵盖物理学、材料科学与工程、电子科学与技术、生物医学技术四个学科门类，多个有突出特色的学科研究方向，在国际国内有一定影响，我国最有名望的物理院系之一。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5l5ltddj20m80goq6f.jpg"],
  [30.53905605, 114.3730026, "经济与管理学院学术报告厅", "武汉大学经济与管理学院是武汉大学的二级学院，据2017年3月学校官网显示，武汉大学经济与管理学院是武汉大学办学规模最大的学院。学院前身可追溯到1893年清末湖广总督张之洞创办自强学堂时设立的商务门，其实体根基源自1916年设立的国立武昌商业专门学校。1928年国立武汉大学设经济学系。1981年经济学系与经济管理系分设，1999年经济学院、管理学院和旅游学院合并为商学院。2001年原武汉大学商学院、原武汉水利电力大学经济管理学院与原武汉测绘科技大学经济管理、市场营销教研室合并组建新武汉大学商学院，2005年更名为经济与管理学院。", "http://wx3.sinaimg.cn/mw1024/86ede6e5ly1fgn5k5e5soj20m80gowhi.jpg"],
  [30.52530974, 114.3618339, "莱卡厅", "莱卡厅位于武汉大学信息学部教学实验大楼一楼南侧，是学生活动以及就业宣讲的常用报告厅之一。", "http://wx1.sinaimg.cn/mw1024/86ede6e5gy1fgn808crwxj20m80go0w0.jpg"],
  [30.52836875, 114.3592805, "就业中心第一、二、三报告厅", "武汉大学学生就业指导与服务中心(以下简称“中心”)成立于2013年9月。中心是在学校就业工作领导小组的指导下，贯彻落实国家大学生就业工作方针政策，行使在校学生就业服务、指导、教育和管理职能的部门。</br>中心设立了就业信息与市场开拓办公室、就业指导与咨询办公室、就业管理办公室和综合办公室四个部门。</br>学生就业指导与服务中心完成学生毕业和就业的相关工作，内容包括：根据国家各项方针、政策以及学校有关要求，制定毕业生就业工作意见及实施细则，充分宣传各项相关政策;主动向社会各界发布毕业生信息，深入挖掘社会需求，收集并以多种形式及时发布各类用人单位需求;组织校园宣传及招聘活动;开展就业咨询及指导;办理就业协议签订事宜，形成毕业生就业方案，完成上级部门各类业务工作;负责毕业生派遣和学生档案管理相关事宜;开展各类调查研究，组织科研课题项目完成等。", "http://wx1.sinaimg.cn/mw1024/86ede6e5gy1fgn5b1qkhqj20m80goae5.jpg"],
  [30.52832254, 114.3592751, "就业中心卓越厅", "武汉大学学生就业指导与服务中心(以下简称“中心”)成立于2013年9月。中心是在学校就业工作领导小组的指导下，贯彻落实国家大学生就业工作方针政策，行使在校学生就业服务、指导、教育和管理职能的部门。</br>中心设立了就业信息与市场开拓办公室、就业指导与咨询办公室、就业管理办公室和综合办公室四个部门。</br>学生就业指导与服务中心完成学生毕业和就业的相关工作，内容包括：根据国家各项方针、政策以及学校有关要求，制定毕业生就业工作意见及实施细则，充分宣传各项相关政策;主动向社会各界发布毕业生信息，深入挖掘社会需求，收集并以多种形式及时发布各类用人单位需求;组织校园宣传及招聘活动;开展就业咨询及指导;办理就业协议签订事宜，形成毕业生就业方案，完成上级部门各类业务工作;负责毕业生派遣和学生档案管理相关事宜;开展各类调查研究，组织科研课题项目完成等。", "http://wx2.sinaimg.cn/mw1024/86ede6e5gy1fgn5azz3t2j20m80gowiu.jpg"],
  [30.52786046, 114.36001, "武汉大学生就业市场综合厅", "武汉大学生就业市场是华中地区唯一的国家级区域性人才市场，经过十多年快速发展，已经成为我国中部最大的人才资源服务机构。每年举办各类现场招聘会近百场，进场招聘单位近万家，进场择业人员达51余万人次；", "http://wx2.sinaimg.cn/mw1024/86ede6e5gy1fgn5azz3t2j20m80gowiu.jpg"],
  [30.53911611, 114.367767, "人文科学馆报告厅", "1990年11月20日竣工的人文科学馆，由香港著名实业家和爱国人士邵逸夫爵士捐款和原国家教委拨款共建，东南大学建筑设计研究院设计，设计新颖，建造精良，是一座现代化的多功能综合性人文科学大楼。", "http://wx3.sinaimg.cn/mw1024/86ede6e5gy1fgn5b0q2t2j20m80go0vd.jpg"],
];
var TIYUGUAN_M = [
  [30.54391646, 114.3666297, "工学部体育馆", "工学部体育馆，位于工学部操场旁边。", "http://wx2.sinaimg.cn/mw1024/86ede6e5ly1fgn5e7zlswj20m80gojto.jpg"],
  [30.52774494, 114.3624884, "信息学部体育馆", "信息学部体育馆，位于武汉大学信息学部篮球场东侧，室内提供羽毛球、乒乓球等活动场地。", "http://wx4.sinaimg.cn/mw1024/86ede6e5ly1fgn5e8x2imj20m80goq56.jpg"],
  [30.53825674, 114.3617374, "宋卿体育馆", "宋卿体育馆（武汉大学体育馆）位于珞珈山南部底。 馆长约35.05米，宽约21.34米，建筑面积2748平方米，由上海六合公司中标承建。1936年，国立武汉大学时任该校体育主任袁浚多方奔走，争取黎元洪家属捐赠10万元，实用12.7万元，体育馆四周绕有回廊， 形成轮舵式山墙和三重檐歇山顶。既表现出现代新型大跨度结构的建筑技术，又保持和发挥了中国传统建筑的特色。并以武汉黄陂人黎元洪之号命名为“宋卿体育馆”。", "http://wx1.sinaimg.cn/mw1024/86ede6e5ly1fgn5e8o3egj20m80godk3.jpg"],
];

var DITIE_M = [
  [30.52244009, 114.3643981, "地铁2号线-广埠屯站"],
  [30.52657586, 114.3532884, "地铁2号线-街道口站"],
];


function ALLDATA(){
  var D={
    DXH: DXH,
    WLXB: WLXB,
    GXB: GXB,
    SCHOOLS: SCHOOLS_M,
    SCHOOLSGATE: SCHOOLSGATE_M,
    JIUYE:JIUYE_M,
    BAOGAOTING:BAOGAOTING_M,
    TIYUGUAN: TIYUGUAN_M,
    DITIE:DITIE_M,
  };
}

function DXH_L() {
  return [data2polyline(DXH, '#f7994b', 4, true)];
}

function DXH_M() {
  return data2marker(DXH, "DXH", '/icon/xiaoba.png', 32, 36);
}

function WLXB_L() {
  return [data2polyline(WLXB, '#f7994b',4, true)];
}

function WLXB_M() {
  return data2marker(WLXB, "WLXB", '/icon/xiaoba.png', 32, 36);
}

function GXB_L() {
  return [data2polyline(GXB[0], '#f7994b', 4, true), data2polyline(GXB[1], '#f7994b', 4, true)]
}

function GXB_M() {
  return data2marker(GXB[0], "GXB", '/icon/xiaoba.png', 32, 36);
}

function SCHOOLS() {
  return data2marker(SCHOOLS_M, "SCHOOLS", '/icon/xueyuan.png', 32, 36);
}

function SCHOOLS_GATE() {
  var SG_M=[];
  SG_M=SG_M.concat(data2marker(SCHOOLSGATE_M[0], "SCHOOLSGATE_0", '/icon/xiaomentongxing.png', 32, 36));
  SG_M = SG_M.concat(data2marker(SCHOOLSGATE_M[1], "SCHOOLSGATE_1", '/icon/jinzhishiru.png', 32, 36));
  SG_M = SG_M.concat(data2marker(SCHOOLSGATE_M[2], "SCHOOLSGATE_2", '/icon/jinzhishichu.png', 32, 36));
  return SG_M;
}

function JIUYE(){
  return data2marker(JIUYE_M, "JIUYE", '/icon/jiuye.png', 32, 36);
}

function TIYUGUAN(){
  return data2marker(TIYUGUAN_M, "TIYUGUAN", '/icon/tiyuguan.png', 32, 36);
}

function BAOGAOTING(){
  return data2marker(BAOGAOTING_M, "BAOGAOTING", '/icon/baogaoting.png', 32, 36);
}

function DITIE(){
  return data2marker(DITIE_M, "DITIE", '/icon/ditie.png', 32, 36);
}

function data2polyline(cur_data, cur_color, cur_width, cur_dottedLine) {
  var cur_points = [];
  for (var i = 0; i < cur_data.length; i++) {
    var c_data = cur_data[i];
    var v_point = {};
    v_point.longitude = c_data[1];
    v_point.latitude = c_data[0];
    cur_points.push(v_point);
  }
  return {
    points: cur_points,
    color: cur_color,
    width: cur_width,
    dottedLine: cur_dottedLine,
  }
}

function data2marker(cur_data, cur_marker_type, cur_iconPath, cur_width, cur_height) {
  var cur_markers = [];
  for (var i = 0; i < cur_data.length; i++) {
    var c_data = cur_data[i];
    if (c_data[2] == 0 || c_data[2] == "0") {
      continue;
    }
    var cur_marker = {};
    cur_marker.id = cur_marker_type + "_" + i;
    cur_marker.longitude = c_data[1];
    cur_marker.latitude = c_data[0];
    cur_marker.iconPath = cur_iconPath;
    cur_marker.width = cur_width;
    cur_marker.height = cur_height;
    cur_marker.title = c_data[2];
    cur_markers.push(cur_marker);
  }
  return cur_markers;
}

